name: "multilabel-datalayer"
layer {
  name: "data"
  type: "ImageMultilabelData"
  top: "data"
  top: "label"
  transform_param {
    mean_value: 128
    mean_value: 128
    mean_value: 128
  }
  image_multilabel_data_param {
    mirror: true
    source: "train.txt"
    root_folder: "./"
    new_height: 224 
    new_width: 224 
    batch_size: 3
    shuffle: true 
    label_dim: 3
   }
}
layer {
  name: "slice"
  type: "Slice"
  bottom: "label"
  top: "label1"
  top: "label2"
  top: "label3"
  slice_param {
    axis: 1
    slice_point:1
    slice_point:2
  }
}
